package com.kerite.pokedex

// MSP图像每行的精灵数量
val MSP_WIDTH = 30

// MSP图像的行数
val MSP_HEIGHT = 42

// 极巨化的精灵的图鉴序号
val GIGANTAMAX_DEX_NUMBERS = arrayOf(
    3, 6, 9, 12, 25, 52, 68, 94, 99, 131, 133, 143, 569, 809, 812, 815, 818,
    823, 826, 834, 839, 841, 842, 844, 849, 851, 858, 861, 869, 879, 884, 892,
)

// 有MEGA形态的精灵图鉴编号
val MEGA_DEX_NUMBER = arrayOf(
    3, 6, 9, 15, 18, 65, 80, 94, 115, 127, 130, 142, 150, 181, 208, 212, 214, 229, 248, 254, 260,
    257, 282, 302, 303, 306, 308, 310, 319, 323, 334, 354, 359, 362, 373, 376, 380, 381, 384, 428,
    445, 448, 460, 475, 531, 719
)

// 有两种MEGA的精灵图鉴编号
val MEGA_COUNT_2 = arrayOf(
    6, 150
)

// 未知图腾图鉴编号
val UNOWN_DEX_NUMBER = 201
val UNOWN_COUNT = 28